eshell-init.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>eshell-init</title>
<!-- 2015-01-30 Fri 22:57 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Toby Tripp" />
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.2/css/bootstrap.min.css">
<link rel="stylesheet" href="css/config.css">
<link rel="stylesheet" href="css/htmlize.css">
</head>
<body>
<div id="preamble" class="status">
<p><a accesskey="H" href="index.html">HOME</a></p>
</div>
<div id="content">
<h1 class="title">eshell-init</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">EShell</h2>
<div class="outline-text-2" id="text-1">
<p>
EShell is a shell written in elisp.  This makes it both less
capable than other terminal emulators and also gives it some
interesting features.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Opening EShells</h3>
<div class="outline-text-3" id="text-1-1">
<p>
First, a short-cut to quickly open a shell.  Repeated invocations
will bring back the same shell so we don't end up with a bunch of
them runningn about.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span>global-set-key <span style="color: #b58900;">(</span>kbd <span style="color: #2aa198;">"C-x m"</span><span style="color: #b58900;">)</span> 'eshell<span style="color: #f5deb3;">)</span>
</pre>
</div>

<p>
It's nice to have an easy short-cut to launch into a shell in the
current buffer's directory.  We'll start with a function to lauch it:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">toby/eshell-in-buffer-dir</span> <span style="color: #b58900;">()</span>
  <span style="color: #2aa198; font-style: italic;">"Open eshell in the current buffer's directory"</span>
  <span style="color: #b58900;">(</span>interactive<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #268bd2;">(</span><span style="color: #dc322f;">(</span>dir default-directory<span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #dc322f;">(</span><span style="color: #cb4b16;">(</span>b <span style="color: #268bd2;">(</span>get-buffer eshell-buffer-name<span style="color: #268bd2;">)</span><span style="color: #cb4b16;">)</span><span style="color: #dc322f;">)</span>
      <span style="color: #dc322f;">(</span><span style="color: #859900; font-weight: bold;">unless</span> b <span style="color: #cb4b16;">(</span>eshell<span style="color: #cb4b16;">)</span><span style="color: #dc322f;">)</span>
      <span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>display-buffer eshell-buffer-name t<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>switch-to-buffer-other-window eshell-buffer-name<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>end-of-buffer<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">unless</span> <span style="color: #dc322f;">(</span>equalp dir default-directory<span style="color: #dc322f;">)</span>
      <span style="color: #dc322f;">(</span>cd dir<span style="color: #dc322f;">)</span>
      <span style="color: #dc322f;">(</span>eshell-send-input<span style="color: #dc322f;">)</span>
      <span style="color: #dc322f;">(</span>end-of-buffer<span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>
</pre>
</div>

<p>
and a binding to launch it:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span>global-set-key <span style="color: #b58900;">(</span>kbd <span style="color: #2aa198;">"C-x C-m"</span><span style="color: #b58900;">)</span> 'toby/eshell-in-buffer-dir<span style="color: #f5deb3;">)</span>
</pre>
</div>

<p>
Sometimes what you want <i>is</i> another shell instance:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #586e75;">;; </span><span style="color: #586e75;">Start a new eshell even if one is active.</span>
 <span style="color: #f5deb3;">(</span>global-set-key <span style="color: #b58900;">(</span>kbd <span style="color: #2aa198;">"C-x M"</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">lambda</span> <span style="color: #268bd2;">()</span> <span style="color: #268bd2;">(</span>interactive<span style="color: #268bd2;">)</span> <span style="color: #268bd2;">(</span>eshell t<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>
</pre>
</div>

<p>
One great feature of Eshell is its ability to call Emacs functions
as though they were shell commands.  Here we'll define an alias
<code>ff</code> that will open a file from the Eshell command line into an
Emacs buffer:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span>add-hook 'eshell-mode-hook
          <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">lambda</span> <span style="color: #268bd2;">()</span>
            <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">defalias</span> '<span style="color: #268bd2;">ff</span> 'find-file<span style="color: #268bd2;">)</span>
            <span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>
</pre>
</div>

<p>
Adjust some <code>comint</code> parameters (the mode that handles terminal buffers).
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span>setq comint-buffer-maximum-size 10240<span style="color: #f5deb3;">)</span>
<span style="color: #f5deb3;">(</span>add-hook 'comint-output-filter-functions 'comint-truncate-buffer<span style="color: #f5deb3;">)</span>
<span style="color: #f5deb3;">(</span>add-hook 'comint-output-filter-functions 'comint-watch-for-password-prompt<span style="color: #f5deb3;">)</span>
</pre>
</div>

<p>
Multi-term is an extension for running multiple native shells within Emacs:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span>require-package 'multi-term<span style="color: #f5deb3;">)</span>
<span style="color: #f5deb3;">(</span>setq multi-term-program <span style="color: #2aa198;">"/bin/bash -l"</span><span style="color: #f5deb3;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span><span style="color: #859900; font-weight: bold;">provide</span> '<span style="color: #268bd2; font-weight: bold;">eshell-hooks</span><span style="color: #f5deb3;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Comint Mode</h2>
<div class="outline-text-2" id="text-2">
<p>
<code>comint-mode</code> is the parent mode of many shell modes.
</p>

<p>
Let's add a function to easily clear an active shell buffer:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">clear-shell</span> <span style="color: #b58900;">()</span>
  <span style="color: #2aa198; font-style: italic;">"Clear the current shell buffer"</span>
  <span style="color: #b58900;">(</span>interactive<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #268bd2;">(</span><span style="color: #dc322f;">(</span>comint-buffer-maximum-size 0<span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>comint-truncate-buffer<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>
</pre>
</div>

<p>
Binding <code>s-k</code> to <code>kill-buffer</code> doesn't make sense to me.
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span>global-unset-key <span style="color: #b58900;">(</span>kbd <span style="color: #2aa198;">"s-k"</span><span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span><span style="color: #859900; font-weight: bold;">defun</span> <span style="color: #268bd2;">set-my-shell-bindings</span> <span style="color: #b58900;">()</span>
  <span style="color: #b58900;">(</span>interactive<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>local-set-key <span style="color: #268bd2;">(</span>kbd <span style="color: #2aa198;">"&lt;up&gt;"</span><span style="color: #268bd2;">)</span>   'comint-previous-input<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>local-set-key <span style="color: #268bd2;">(</span>kbd <span style="color: #2aa198;">"&lt;down&gt;"</span><span style="color: #268bd2;">)</span> 'comint-next-input<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>local-set-key <span style="color: #268bd2;">(</span>kbd <span style="color: #2aa198;">"s-k"</span><span style="color: #268bd2;">)</span>    'clear-shell<span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>

<span style="color: #f5deb3;">(</span>add-hook 'shell-mode-hook 'set-my-shell-bindings<span style="color: #f5deb3;">)</span>
<span style="color: #f5deb3;">(</span>add-hook 'eshell-mode-hook 'set-my-shell-bindings<span style="color: #f5deb3;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Toby Tripp</p>
<p class="date">Created: 2015-01-30 Fri 22:57</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
